def area(a, b): 
    '''Возвращает площадь прямоугольника по заданным сторонам
        Параметры:
            a (int): сторона a - десятичное число
            b (int): сторона b - десятичное число
        Возвращаемое значение:
            area (int): десятичное число - площадь прямоугольника'''
    return a * b 

def perimeter(a, b): 
    '''Возвращает периметр прямоугольника по заданным сторонам
        Параметры:
            a (int): сторона a - десятичное число
            b (int): сторона b - десятичное число
        Возвращаемое значение:
            perimeter (int): десятичное число - периметр прямоугольника'''
    return (a + b) * 2