
def area(a):
    '''Возвращает площадь квадрата по заданной стороне
        Параметры:
            a (int): сторона a - десятичное число
        Возвращаемое значение:
            area (int): десятичное число - площадь квадрата'''
    return a * a


def perimeter(a):
    '''Возвращает периметр квадрата по заданной стороне
        Параметры:
            a (int): сторона a - десятичное число
        Возвращаемое значение:
            perimeter (int): десятичное число - периметр квадрата'''
    return 4 * a
