def area(a, h): 
    '''Возвращает площадь треугольника по заданной стороне и высоте
        Параметры:
            a (int): сторона a - десятичное число
            h (int): высота h - десятичное число
            
        Возвращаемое значение:
            area (int): десятичное число - площадь треугольника'''
    return a * h / 2 

def perimeter(a, b, c): 
    '''Возвращает периметр треугольника по трём сторонам
        Параметры:
            a (int): сторона a - десятичное число
            b (int): сторона a - десятичное число
            c (int): сторона a - десятичное число
        Возвращаемое значение:
            area (int): десятичное число - периметр треугольника'''
    return a + b + c 